IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/CONTROLSS_FSI1_RX3_CONTROLSS_FSI1_RX3.xml
	<register id="CONTROLSS_FSI1_RX3_RX_FRAME_TAG_UDATA" acronym="CONTROLSS_FSI1_RX3_RX_FRAME_TAG_UDATA" offset="0xE" width="16" description="">
		<bitfield id="USER_DATA" width="8" begin="15" end="8" resetval="0x0" description="Received User Data This field contains the 8-bit user data field of the last successfully received frame." range="15 - 8" rwaccess="RO"/> 
		<bitfield id="FRAME_TAG" width="4" begin="4" end="1" resetval="0x0" description="Received Frame Tag This field contains the 4-bit frame tag from the last successfully received frame. This is intentionally shifted into bits 4:1 so that the register can be used as a 32-bit address index based on the received tag." range="4 - 1" rwaccess="RO"/> 
		<bitfield id="RESERVED" width="1" begin="0" end="0" resetval="0x0" description="Zero bit This bit will always read  as 0. This is intentionally provided to create a 32-bit offset if required. Using the FRAME_TAG  and ZERO bits of this register (bits 4:0), application software can directly index into an array of 32-bit data." range="0" rwaccess="RO"/>
	</register>
	<register id="CONTROLSS_FSI1_RX3_RX_DMA_CTRL" acronym="CONTROLSS_FSI1_RX3_RX_DMA_CTRL" offset="0x10" width="16" description="">
		<bitfield id="DMA_EVT_EN" width="1" begin="0" end="0" resetval="0x0" description="DMA Event Enable bit This bit will enable a DMA Event to be generated upon the completion of a frame reception.  0h (R/W) = A DMA event will not be generated. 1h (R/W) = A DMA event will be generated upon the reception of a frame.  Note: The DMA event will only be generated for data frames." range="0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_FSI1_RX3_RX_EVT_STS_ALT1_" acronym="CONTROLSS_FSI1_RX3_RX_EVT_STS_ALT1_" offset="0x14" width="16" description="">
		<bitfield id="ERROR_TAG_MATCH" width="1" begin="14" end="14" resetval="0x0" description="Error Tag Match Flag This bit indicates that an error frame was received with a  tag comparison matching the masked tag reference. Software can also force this bit to get set by writing to the RX_EVT_FRC register.   0h (R) = No  tag-matched error frame received. 1h (R) = A  tag-matched error frame has been received.  To clear this bit, write to the corresponding bit in the RX_EVT_CLR register." range="14" rwaccess="RO"/> 
		<bitfield id="DATA_TAG_MATCH" width="1" begin="13" end="13" resetval="0x0" description="Data Tag Match Flag This bit indicates that a dataframe was received with a  tag comparison matching the masked tag reference. Software can also force this bit to get set by writing to the RX_EVT_FRC register.   0h (R) = No tag-matched data frame received. 1h (R) = A tag-matched data frame has been received.  To clear this bit, write to the corresponding bit in the RX_EVT_CLR register." range="13" rwaccess="RO"/> 
		<bitfield id="PING_TAG_MATCH" width="1" begin="12" end="12" resetval="0x0" description="Ping Tag Match Flag This bit indicates that a ping frame was received with a  tag comparison matching the masked tag reference. Software can also force this bit to get set by writing to the RX_EVT_FRC register.   0h (R) = No tag-matched ping frame received. 1h (R) = A tag-matched ping frame has been received.  To clear this bit, write to the corresponding bit in the RX_EVT_CLR register." range="12" rwaccess="RO"/> 
		<bitfield id="DATA_FRAME" width="1" begin="11" end="11" resetval="0x0" description="Data Frame Received Flag This bit indicates that an data frame has been received. Software can also force this bit to get set by writing to the RX_EVT_FRC register.   0h (R) = No data frame has been received. 1h (R) = A data frame has been received.  To clear this bit, write to the corresponding bit in the RX_EVT_CLR register." range="11" rwaccess="RO"/> 
		<bitfield id="FRAME_OVERRUN" width="1" begin="10" end="10" resetval="0x0" description="Frame Overrun Flag This bit indicates that a frame overrun condition has occured. This bit gets set to 1 when a new DATA/ERROR frame is received and the corresponding DATA_FRAME_RCVD/ERROR_FRAME_RCVD flag is still set to 1. Software can also force this bit to get set by writing to the RX_EVT_FRC register.   0h (R) = Frame overrun has not ocurred. 1h (R) = Frame overrun has ocurred.  To clear this bit, write to the corresponding bit in the RX_EVT_CLR register." range="10" rwaccess="RO"/> 
		<bitfield id="PING_FRAME" width="1" begin="9" end="9" resetval="0x0" description="Ping Frame Received Flag This bit indicates that an ping frame has been received. Software can also force this bit to get set by writing to the RX_EVT_FRC register.   0h (R) = No ping frame has been received. 1h (R) = A ping frame has been received.  To clear this bit, write to the corresponding bit in the RX_EVT_CLR register." range="9" rwaccess="RO"/> 
		<bitfield id="ERR_FRAME" width="1" begin="8" end="8" resetval="0x0" description="Error Frame Received Flag This bit indicates that an error frame has been received. Software can also force this bit to get set by writing to the RX_EVT_FRC register.   0h (R) = No error frame has been received. 1h (R) = An error frame has been received.  To clear this bit, write to the corresponding bit in the RX_EVT_CLR register." range="8" rwaccess="RO"/> 
		<bitfield id="BUF_UNDERRUN" width="1" begin="7" end="7" resetval="0x0" description="Receive Buffer Underrun Flag This bit indicates that a buffer underrun condition has occured in the receive buffer. This will happen when software reads the buffer which is empty and has no valid data. Software can also force this bit to get set by writing to the RX_EVT_FRC register.   0h (R) = Receive Buffer Underrun has not ocurred. 1h (R) = Receive Buffer Underrun has ocurred.  To clear this bit, write to the corresponding bit in the RX_EVT_CLR register." range="7" rwaccess="RO"/> 
		<bitfield id="FRAME_DONE" width="1" begin="6" end="6" resetval="0x0" description="Frame Done Flag This bit indicates that a frame has been successfully received without error. Software can also force this bit to get set by writing to the RX_EVT_FRC register.   0h (R) = No frame has been successfully received. 1h (R) = A frame has been successfully received.  To clear this bit, write to the corresponding bit in the RX_EVT_CLR register." range="6" rwaccess="RO"/> 
		<bitfield id="BUF_OVERRUN" width="1" begin="5" end="5" resetval="0x0" description="Receive Buffer Overrun Flag This bit indicates that a buffer overrun condition has occured in the receive buffer. Software can also force this bit to get set by writing to the RX_EVT_FRC register.   0h (R) = Receive buffer overrun has not ocurred. 1h (R) = Receive buffer overrun has ocurred.  To clear this bit, write to the corresponding bit in the RX_EVT_CLR register." range="5" rwaccess="RO"/> 
		<bitfield id="EOF_ERR" width="1" begin="4" end="4" resetval="0x0" description="End-of-Frame Error Flag This bit indicates that an invalid end-of-frame bit pattern has been received. Software can also force this bit to get set by writing to the RX_EVT_FRC register.   0h (R) = Invalid end-of-frame has not been received. 1h (R) = Invalid end-of-frame has been received  To clear this bit, write to the corresponding bit in the RX_EVT_CLR register." range="4" rwaccess="RO"/> 
		<bitfield id="TYPE_ERR" width="1" begin="3" end="3" resetval="0x0" description="Frame Type Error Flag This bit inditcates that an invalid frame type has been received. Software can also force this bit to get set by writing to the RX_EVT_FRC register.   0h (R) = Invalid frame type has not been received. 1h (R) = Invalid frame type has been received  To clear this bit, write to the corresponding bit in the RX_EVT_CLR register." range="3" rwaccess="RO"/> 
		<bitfield id="CRC_ERR" width="1" begin="2" end="2" resetval="0x0" description="CRC Error Flag This bit indicates that a CRC error has occured. A CRC error will be generated on a data frame where the received CRC and the computed CRC do not match. Software can also force this bit to get set by writing to the RX_EVT_FRC register.   0h (R) = CRC error has not occured. 1h (R) = CRC error has occured.  To clear this bit, write to the corresponding bit in the RX_EVT_CLR register." range="2" rwaccess="RO"/> 
		<bitfield id="FRAME_WD_TO" width="1" begin="1" end="1" resetval="0x0" description="Frame Watchdog Timeout Flag This bit indicates that the frame watchdog timer has timed out. Software can also force this bit to get set by writing to the RX_EVT_FRC register.   0h (R) = Frame watchdog timeout has not occured. 1h (R) = Frame watchdog timeout has occured.  To clear this bit, write to the corresponding bit in the RX_EVT_CLR register." range="1" rwaccess="RO"/> 
		<bitfield id="PING_WD_TO" width="1" begin="0" end="0" resetval="0x0" description="Ping Watchdog Timeout Flag This bit indicates that the ping watchdog timer has timed out. Software can also force this bit to get set by writing to the RX_EVT_FRC register.   0h (R) = Ping watchdog timeout has not occured. 1h (R) = Ping watchdog timeout has occured.  To clear this bit, write to the corresponding bit in the RX_EVT_CLR register." range="0" rwaccess="RO"/>
	</register>
	<register id="CONTROLSS_FSI1_RX3_RX_CRC_INFO" acronym="CONTROLSS_FSI1_RX3_RX_CRC_INFO" offset="0x16" width="16" description="">
		<bitfield id="CALC_CRC" width="8" begin="15" end="8" resetval="0x0" description="Harware Calculated CRC Value This bitfield contains the CRC value that was calculated on the last received data. The contents of this bitfield are valid only when data frames are received.   Note: The contents of this bitfield are invalid for ping and error frames." range="15 - 8" rwaccess="RO"/> 
		<bitfield id="RX_CRC" width="8" begin="7" end="0" resetval="0x0" description="Received CRC Value This bitfield contains the CRC value that was last received a frame. The contents of this bitfield are valid only when data frames are received.   Note: The contents of this bitfield are invalid for ping and error frames." range="7 - 0" rwaccess="RO"/>
	</register>
	<register id="CONTROLSS_FSI1_RX3_RX_EVT_CLR_ALT1_" acronym="CONTROLSS_FSI1_RX3_RX_EVT_CLR_ALT1_" offset="0x18" width="16" description="">
		<bitfield id="ERROR_TAG_MATCH" width="1" begin="14" end="14" resetval="0x0" description="Error Tag Match Glag Clear bit This bit clears the corresponding bit in the RX_EVT_STS register.  0h (W) = Writing a 0 to this bit will have no effect. 1h (W) = Writing a 1 to this bit will clear the corresponding bit in the RX_EVT_STS register to 0." range="14" rwaccess="WO"/> 
		<bitfield id="DATA_TAG_MATCH" width="1" begin="13" end="13" resetval="0x0" description="Data Tag Match Flag Clear bit This bit clears the corresponding bit in the RX_EVT_STS register.  0h (W) = Writing a 0 to this bit will have no effect. 1h (W) = Writing a 1 to this bit will clear the corresponding bit in the RX_EVT_STS register to 0." range="13" rwaccess="WO"/> 
		<bitfield id="PING_TAG_MATCH" width="1" begin="12" end="12" resetval="0x0" description="Ping Tag Match Flag Clear bit This bit clears the corresponding bit in the RX_EVT_STS register.  0h (W) = Writing a 0 to this bit will have no effect. 1h (W) = Writing a 1 to this bit will clear the corresponding bit in the RX_EVT_STS register to 0." range="12" rwaccess="WO"/> 
		<bitfield id="DATA_FRAME" width="1" begin="11" end="11" resetval="0x0" description="Data Frame Received Flag Clear bit This bit clears the corresponding bit in the RX_EVT_STS register.  0h (W) = Writing a 0 to this bit will have no effect. 1h (W) = Writing a 1 to this bit will clear the corresponding bit in the RX_EVT_STS register to 0." range="11" rwaccess="WO"/> 
		<bitfield id="FRAME_OVERRUN" width="1" begin="10" end="10" resetval="0x0" description="Frame Overrun Flag Clear bit This bit clears the corresponding bit in the RX_EVT_STS register.  0h (W) = Writing a 0 to this bit will have no effect. 1h (W) = Writing a 1 to this bit will clear the corresponding bit in the RX_EVT_STS register to 0." range="10" rwaccess="WO"/> 
		<bitfield id="PING_FRAME" width="1" begin="9" end="9" resetval="0x0" description="Ping Frame Received Flag Clear bit This bit clears the corresponding bit in the RX_EVT_STS register.  0h (W) = Writing a 0 to this bit will have no effect. 1h (W) = Writing a 1 to this bit will clear the corresponding bit in the RX_EVT_STS register to 0." range="9" rwaccess="WO"/> 
		<bitfield id="ERR_FRAME" width="1" begin="8" end="8" resetval="0x0" description="Error Frame Received Flag Clear bit This bit clears the corresponding bit in the RX_EVT_STS register.  0h (W) = Writing a 0 to this bit will have no effect. 1h (W) = Writing a 1 to this bit will clear the corresponding bit in the RX_EVT_STS register to 0." range="8" rwaccess="WO"/> 
		<bitfield id="BUF_UNDERRUN" width="1" begin="7" end="7" resetval="0x0" description="Receive Buffer Underrun Flag Clear bit This bit clears the corresponding bit in the RX_EVT_STS register.  0h (R/W) = Writing a 0 to this bit will have no effect. 1h (R/W) = Writing a 1 to this bit will clear the corresponding bit in the RX_EVT_STS register to 0." range="7" rwaccess="WO"/> 
		<bitfield id="FRAME_DONE" width="1" begin="6" end="6" resetval="0x0" description="Frame Done Flag Clear bit This bit clears the corresponding bit in the RX_EVT_STS register.  0h (W) = Writing a 0 to this bit will have no effect. 1h (W) = Writing a 1 to this bit will clear the corresponding bit in the RX_EVT_STS register to 0." range="6" rwaccess="WO"/> 
		<bitfield id="BUF_OVERRUN" width="1" begin="5" end="5" resetval="0x0" description="Receive Buffer Overrun Flag Clear bit This bit clears the corresponding bit in the RX_EVT_STS register.  0h (W) = Writing a 0 to this bit will have no effect. 1h (W) = Writing a 1 to this bit will clear the corresponding bit in the RX_EVT_STS register to 0." range="5" rwaccess="WO"/> 
		<bitfield id="EOF_ERR" width="1" begin="4" end="4" resetval="0x0" description="End-of-Frame Error Flag Clear bit This bit clears the corresponding bit in the RX_EVT_STS register.  0h (W) = Writing a 0 to this bit will have no effect. 1h (W) = Writing a 1 to this bit will clear the corresponding bit in the RX_EVT_STS register to 0." range="4" rwaccess="WO"/> 
		<bitfield id="TYPE_ERR" width="1" begin="3" end="3" resetval="0x0" description="Frame Type Error Flag Clear bit This bit clears the corresponding bit in the RX_EVT_STS register.  0h (W) = Writing a 0 to this bit will have no effect. 1h (W) = Writing a 1 to this bit will clear the corresponding bit in the RX_EVT_STS register to 0." range="3" rwaccess="WO"/> 
		<bitfield id="CRC_ERR" width="1" begin="2" end="2" resetval="0x0" description="CRC Error Flag Clear bit This bit clears the corresponding bit in the RX_EVT_STS register.  0h (W) = Writing a 0 to this bit will have no effect. 1h (W) = Writing a 1 to this bit will clear the corresponding bit in the RX_EVT_STS register to 0." range="2" rwaccess="WO"/> 
		<bitfield id="FRAME_WD_TO" width="1" begin="1" end="1" resetval="0x0" description="Frame Watchdog Timeout Flag Clear bit This bit clears the corresponding bit in the RX_EVT_STS register.  0h (W) = Writing a 0 to this bit will have no effect. 1h (W) = Writing a 1 to this bit will clear the corresponding bit in the RX_EVT_STS register to 0." range="1" rwaccess="WO"/> 
		<bitfield id="PING_WD_TO" width="1" begin="0" end="0" resetval="0x0" description="Ping Watchdog Timeout Flag Clear bit This bit clears the corresponding bit in the RX_EVT_STS register.  0h (W) = Writing a 0 to this bit will have no effect. 1h (W) = Writing a 1 to this bit will clear the corresponding bit in the RX_EVT_STS register to 0." range="0" rwaccess="WO"/>
	</register>
