IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/CONTROLSS_FSI1_RX3_CONTROLSS_FSI1_RX3.xml
	<register id="CONTROLSS_FSI1_RX3_RX_ECC_DATA" acronym="CONTROLSS_FSI1_RX3_RX_ECC_DATA" offset="0x40" width="32" description="">
		<bitfield id="DATA_HIGH" width="16" begin="31" end="16" resetval="0x0" description="Upper 16 bits of ECC Data Writing to this bitfield will cause the ECC logic to compute the ECC(SEC-DED) the entire 32-bit register and update TX_ECC_VAL register with the results. Software should write to these 16 bits of the register in a 32-bit write when needing to compute ECC for 32-bits for the full TX_ECC_DATA register." range="31 - 16" rwaccess="RW"/> 
		<bitfield id="DATA_LOW" width="16" begin="15" end="0" resetval="0x0" description="Lower 16 bits of ECC Data Writing to this bitfield will cause the ECC logic to compute the ECC(SEC-DED) for these 16 bits and update the TX_ECC_VAL register with the results. Software should write to these register bits as a 16-bit write when needing to compute ECC for 16-bits." range="15 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_FSI1_RX3_RX_ECC_VAL" acronym="CONTROLSS_FSI1_RX3_RX_ECC_VAL" offset="0x44" width="16" description="">
		<bitfield id="ECC_VAL" width="7" begin="6" end="0" resetval="0x0" description="ECC Value for SEC-DED check This field contains the ECC value to be used for SEC-DED either for 16-bit or 32-bit data in the RX_ECC_DATA register." range="6 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_FSI1_RX3_RX_ECC_SEC_DATA" acronym="CONTROLSS_FSI1_RX3_RX_ECC_SEC_DATA" offset="0x48" width="32" description="">
		<bitfield id="SEC_DATA" width="32" begin="31" end="0" resetval="0x0" description="ECC Single Error Corrected Data The ECC corrected data will be available in this register. This value is valid only when there are no bit errors, or a single bit error was detected. Otherwise, the contents of this register are invalid and should not be used." range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="CONTROLSS_FSI1_RX3_RX_ECC_LOG" acronym="CONTROLSS_FSI1_RX3_RX_ECC_LOG" offset="0x4C" width="16" description="">
		<bitfield id="MBE" width="1" begin="1" end="1" resetval="0x1" description="Multiple Bit Errors Detected This bit indicates the occurrence of multiple bit errors.The data is corrupted and cannot be corrected. If this bit is set, the data present in RX_ECC_SEC_DATA is invalid and should not be used.  0h (R) Multiple Bit Errors were not detected. Check the SBE bit for single bit errors. 1h (R) Multiple Bit Errors were detected. The data is not able to be corrected. The value present in RX_ECC_SEC_DATA is invalid and should not be used." range="1" rwaccess="RO"/> 
		<bitfield id="SBE" width="1" begin="0" end="0" resetval="0x1" description="Single Bit Error Detected This bit indicates the occurrence of a single bit error in the data. The data is autocorrected and placed into the RX_ECC_SEC_DATA register. This bit is valid only if MBE is 0.  0h (R) No bit errors were detected. The value in RX_ECC_SEC_DATA is correct.  1h (R) A single bit error was detected and corrected. The corrected data is present in RX_ECC_SEC_DATA." range="0" rwaccess="RO"/>
	</register>
	<register id="CONTROLSS_FSI1_RX3_RX_FRAME_TAG_CMP" acronym="CONTROLSS_FSI1_RX3_RX_FRAME_TAG_CMP" offset="0x50" width="16" description="">
		<bitfield id="BROADCAST_EN" width="1" begin="9" end="9" resetval="0x0" description="Broadcast Enable bit This will enable the reception of a ping frame broadcast. When this bit is set, bit 3 of the received tag will be treated as a broadcast notification. If bit 3 of the received tag is set to 1, a ping tag match event will be triggered regardless of the. A match caused by the comparison of TAG_MASK and TAG_REF will still be considered a match and the frame tag match event will be triggered as normal  This bit only takes effect only if CMP_EN is set to 1.  0h (R/W) Broadcast frame match disabled. 1h (R/W) Broadcast frame match enabled." range="9" rwaccess="RW"/> 
		<bitfield id="CMP_EN" width="1" begin="8" end="8" resetval="0x0" description="Frame Tag Compare Enable bit Set this bit to enable the comparison of an incoming frame  tag and the value stored in the frame tag reference. A match caused by the comparison of TAG_MASK, TAG_REF, and the incoming frame tag will trigger the apprpriate frame tag match event.  0h (R/W) Frame tag comparison is disabled. 1h (R/W) Frame tag comparison is enabled." range="8" rwaccess="RW"/> 
		<bitfield id="TAG_MASK" width="4" begin="7" end="4" resetval="0x0" description="Frame Tag Mask Any bit position in this register set to 0 will be used in the comparison of the incoming frame tag and the value stored in TAG_REF. A bit position set to 1 will be ignored in the tag comparison.  This mask value is used only for non-ping frames." range="7 - 4" rwaccess="RW"/> 
		<bitfield id="TAG_REF" width="4" begin="3" end="0" resetval="0x0" description="Frame Tag Reference The reference tag to check against when comparing the TAG_MASK and the incoming frame tag.  This reference value is used only for non-ping frames." range="3 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_FSI1_RX3_RX_PING_TAG_CMP" acronym="CONTROLSS_FSI1_RX3_RX_PING_TAG_CMP" offset="0x52" width="16" description="">
		<bitfield id="BROADCAST_EN" width="1" begin="9" end="9" resetval="0x0" description="Broadcast Enable bit This will enable the reception of a ping frame broadcast. When this bit is set, bit 3 of the received tag will be treated as a broadcast notification. If bit 3 of the received tag is set to 1, a ping tag match event will be triggered regardless of the. A match caused by the comparison of TAG_MASK and TAG_REF will still be considered a match and the ping tag match event will be triggered as normal  This bit only takes effect only if CMP_EN is set to 1.  0h (R/W) Broadcast frame match disabled. 1h (R/W) Broadcast frame match enabled." range="9" rwaccess="RW"/> 
		<bitfield id="CMP_EN" width="1" begin="8" end="8" resetval="0x0" description="Ping Tag Compare Enable bit Set this bit to enable the comparison of an incoming ping tag and the value stored in the ping tag reference. A match caused by the comparison of TAG_MASK, TAG_REF, and the incoming ping tag will trigger a ping frame tag match event.  0h (R/W) Ping tag comparison is disabled. 1h (R/W) Ping tag comparison is enabled." range="8" rwaccess="RW"/> 
		<bitfield id="TAG_MASK" width="4" begin="7" end="4" resetval="0x0" description="Ping Tag Mask Any bit position in this register set to 0 will be used in the comparison of the incoming ping frame tag and the value stored in TAG_REF. A bit position set to 1 will be ignored in the tag comparison.  This mask value is used only for ping frames." range="7 - 4" rwaccess="RW"/> 
		<bitfield id="TAG_REF" width="4" begin="3" end="0" resetval="0x0" description="Ping Tag Reference The reference tag to check against when comparing the TAG_MASK and the incoming ping tag.  This reference value is used only for ping frames." range="3 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_FSI1_RX3_RX_TRIG_CTRL_0" acronym="CONTROLSS_FSI1_RX3_RX_TRIG_CTRL_0" offset="0x58" width="32" description="">
		<bitfield id="RX_TRIG_DLY" width="24" begin="31" end="8" resetval="0x0" description="This is the 24 bit count of the trigger delay in SYSCLK cycles. If enabled, the Trigger-1 output of the trigger module will generate a 3 SYSCLK wide trigger pulse after the selected input trigger source sees a rising edge with a delay defined by this 24-bt value." range="31 - 8" rwaccess="RW"/> 
		<bitfield id="TRIG_SEL" width="4" begin="4" end="1" resetval="0x0" description="This is the mux select value which selects which of the inputs will be used as the trigger source." range="4 - 1" rwaccess="RW"/> 
		<bitfield id="TRIG_EN" width="1" begin="0" end="0" resetval="0x0" description="This is the enable for the RX output trigger generation. The output triggers will be generated only if this bit is set to 1. If this bit is 0, then no trigger will be generated by this module." range="0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_FSI1_RX3_RX_TRIG_WIDTH_0" acronym="CONTROLSS_FSI1_RX3_RX_TRIG_WIDTH_0" offset="0x5C" width="32" description="">
		<bitfield id="RX_TRIG_WIDTH" width="16" begin="15" end="0" resetval="0x0" description="This register decides the width(in SYSCLK cycles) of wide pulse output of the RX trigger module." range="15 - 0" rwaccess="RW"/>
	</register>
