IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/CONTROLSS_FSI1_RX3_CONTROLSS_FSI1_RX3.xml
	<register id="CONTROLSS_FSI1_RX3_RX_DLYLINE_CTRL" acronym="CONTROLSS_FSI1_RX3_RX_DLYLINE_CTRL" offset="0x60" width="16" description="">
		<bitfield id="RXD1_DLY" width="5" begin="14" end="10" resetval="0x0" description="Delay Line Tap Select for RXD1 This bitfield selects the number of delay elements inserted into the RXD1 path from the pin boundary to the receiver core.  0h (R/W) Zero delay elements are included in the RXD1 path. RXD1 is taken directly from the pin. 1h (R/W) One delay element is included in the RXD1 path. 2h (R/W) Two delay elements are included in the RXD1 path. ... 1Fh (R/W) 31 delay elements are included in the RXD1 path, the maximum." range="14 - 10" rwaccess="RW"/> 
		<bitfield id="RXD0_DLY" width="5" begin="9" end="5" resetval="0x0" description="Delay Line Tap Select for RXD0 This bitfield selects the number of delay elements inserted into the RXD0 path from the pin boundary to the receiver core.  0h (R/W) Zero delay elements are included in the RXD0 path. RXD0 is taken directly from the pin. 1h (R/W) One delay element is included in the RXD0 path. 2h (R/W) Two delay elements are included in the RXD0 path. ... 1Fh (R/W) 31 delay elements are included in the RXD0 path, the maximum." range="9 - 5" rwaccess="RW"/> 
		<bitfield id="RXCLK_DLY" width="5" begin="4" end="0" resetval="0x0" description="Delay Line Tap Select for RXCLK This bitfield selects the number of delay elements inserted into the RXCLK path from the pin boundary to the receiver core.  0h (R/W) Zero delay elements are included in the RXCLK path. RXCLK is taken directly from the pin. 1h (R/W) One delay element is included in the RXCLK path. 2h (R/W) Two delay elements are included in the RXCLK path. ... 1Fh (R/W) 31 delay elements are included in the RXCLK path, the maximum." range="4 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_FSI1_RX3_RX_TRIG_CTRL_1" acronym="CONTROLSS_FSI1_RX3_RX_TRIG_CTRL_1" offset="0x64" width="32" description="">
		<bitfield id="RX_TRIG_DLY" width="24" begin="31" end="8" resetval="0x0" description="This is the 24 bit count of the trigger delay in SYSCLK cycles. If enabled, the Trigger-1 output of the trigger module will generate a 3 SYSCLK wide trigger pulse after the selected input trigger source sees a rising edge with a delay defined by this 24-bt value." range="31 - 8" rwaccess="RW"/> 
		<bitfield id="TRIG_SEL" width="4" begin="4" end="1" resetval="0x0" description="This is the mux select value which selects which of the inputs will be used as the trigger source." range="4 - 1" rwaccess="RW"/> 
		<bitfield id="TRIG_EN" width="1" begin="0" end="0" resetval="0x0" description="This is the enable for the RX output trigger generation. The output triggers will be generated only if this bit is set to 1. If this bit is 0, then no trigger will be generated by this module." range="0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_FSI1_RX3_RX_TRIG_CTRL_2" acronym="CONTROLSS_FSI1_RX3_RX_TRIG_CTRL_2" offset="0x68" width="32" description="">
		<bitfield id="RX_TRIG_DLY" width="24" begin="31" end="8" resetval="0x0" description="This is the 24 bit count of the trigger delay in SYSCLK cycles. If enabled, the Trigger-1 output of the trigger module will generate a 3 SYSCLK wide trigger pulse after the selected input trigger source sees a rising edge with a delay defined by this 24-bt value." range="31 - 8" rwaccess="RW"/> 
		<bitfield id="TRIG_SEL" width="4" begin="4" end="1" resetval="0x0" description="This is the mux select value which selects which of the inputs will be used as the trigger source." range="4 - 1" rwaccess="RW"/> 
		<bitfield id="TRIG_EN" width="1" begin="0" end="0" resetval="0x0" description="This is the enable for the RX output trigger generation. The output triggers will be generated only if this bit is set to 1. If this bit is 0, then no trigger will be generated by this module." range="0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_FSI1_RX3_RX_TRIG_CTRL_3" acronym="CONTROLSS_FSI1_RX3_RX_TRIG_CTRL_3" offset="0x6C" width="32" description="">
		<bitfield id="RX_TRIG_DLY" width="24" begin="31" end="8" resetval="0x0" description="This is the 24 bit count of the trigger delay in SYSCLK cycles. If enabled, the Trigger-1 output of the trigger module will generate a 3 SYSCLK wide trigger pulse after the selected input trigger source sees a rising edge with a delay defined by this 24-bt value." range="31 - 8" rwaccess="RW"/> 
		<bitfield id="TRIG_SEL" width="4" begin="4" end="1" resetval="0x0" description="This is the mux select value which selects which of the inputs will be used as the trigger source." range="4 - 1" rwaccess="RW"/> 
		<bitfield id="TRIG_EN" width="1" begin="0" end="0" resetval="0x0" description="This is the enable for the RX output trigger generation. The output triggers will be generated only if this bit is set to 1. If this bit is 0, then no trigger will be generated by this module." range="0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_FSI1_RX3_RX_VIS_1" acronym="CONTROLSS_FSI1_RX3_RX_VIS_1" offset="0x70" width="32" description="">
		<bitfield id="RX_CORE_STS" width="1" begin="3" end="3" resetval="0x0" description="Receiver Core Status bit This bit indicates the status of the receiver core. If this bit is set, the receiver should undergo a reset and subsequent resynchronization with the transmitter. This bit will be always be set when the receiver has detected and end of frame error or a frame type error. This bit can also be set if the receiver becomes corrupted due to noise on the signal lines. If the receiver has experienced a ping watchdog or frame watchdog timeout, this bit should be read to determine if the cause was due to a corrupt transaction, thus putting the receiver core into an unrecoverable state.  Only a soft reset will reset the recevier core and thus reset this bit.  0h (R) The receiver core is operating normally. 1h (R) The receiver core has entered into an error state and should be reset." range="3" rwaccess="RO"/>
	</register>
	<register id="CONTROLSS_FSI1_RX3_RX_UDATA_FILTER" acronym="CONTROLSS_FSI1_RX3_RX_UDATA_FILTER" offset="0x74" width="16" description="">
		<bitfield id="UDATA_MASK" width="8" begin="15" end="8" resetval="0x0" description="Bit Mask to be used for comparing the USERDATA field when filtering is enabled. Every bit that is '1' in this register will be masked for comparison. If a bit position is '1', then it will be considered a successful match for that bit position." range="15 - 8" rwaccess="RW"/> 
		<bitfield id="UDATA_REG" width="8" begin="7" end="0" resetval="0x0" description="Reference to be used for comparing the USERDATA field when filtering is enabled." range="7 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_FSI1_RX3_RX_BUF_BASE" acronym="CONTROLSS_FSI1_RX3_RX_BUF_BASE" offset="0x80" width="16" description="">
		<bitfield id="BASE_ADDRESS" width="16" begin="15" end="0" resetval="0x0" description="Receive Data Buffer Base Address This is the base address of the 16-word data buffer used by the receiver." range="15 - 0" rwaccess="RO"/>
	</register>
</module>